In [2]:
import pandas as pd
df = pd.read_csv("messy_sales.csv")
df

        Date   Product  Quantity  Price
0  2024-01-01   Apple       10.0    2.5
1  2024-01-01   Banana       5.0    1.2
2  2024-01-02    Apple       NaN    2.5
3         NaN   Banana       7.0    1.2
4  2024-01-03    Grape       3.0    NaN
5  2024-01-03    Apple      10.0    2.5
6  2024-01-01   Apple       10.0    2.5

In [3]:
df.isnull()

    Date   Product  Quantity  Price
0   False    False     False  False
1   False    False     False  False
2   False    False      True  False
3    True    False     False  False
4   False    False     False   True
5   False    False     False  False
6   False    False     False  False

In [4]:
df.isnull().sum()

 Date       1
Product     0
Quantity    1
Price       1
dtype: int64

In [8]:
df.dropna(inplace = True)

In [9]:
df

        Date   Product  Quantity  Price
0  2024-01-01   Apple       10.0    2.5
1  2024-01-01   Banana       5.0    1.2
5  2024-01-03    Apple      10.0    2.5
6  2024-01-01   Apple       10.0    2.5

In [10]:
df.duplicated()

0    False
1    False
5    False
6     True
dtype: bool

In [11]:
df.drop_duplicates(inplace = True)
df

        Date   Product  Quantity  Price
0  2024-01-01   Apple       10.0    2.5
1  2024-01-01   Banana       5.0    1.2
5  2024-01-03    Apple      10.0    2.5

In [12]:
df.columns = df.columns.str.strip()
df

         Date  Product  Quantity  Price
0  2024-01-01   Apple       10.0    2.5
1  2024-01-01   Banana       5.0    1.2
5  2024-01-03    Apple      10.0    2.5

In [14]:
df["Date"] = pd.to_datetime(df["Date"], errors = "coerce")
df

        Date  Product  Quantity  Price
0 2024-01-01   Apple       10.0    2.5
1 2024-01-01   Banana       5.0    1.2
5 2024-01-03    Apple      10.0    2.5

In [15]:
df["Total"] = df["Quantity"] * df["Price"]
df

        Date  Product  Quantity  Price  Total
0 2024-01-01   Apple       10.0    2.5   25.0
1 2024-01-01   Banana       5.0    1.2    6.0
5 2024-01-03    Apple      10.0    2.5   25.0

In [18]:
grouped = df.groupby("Product").agg({
    "Quantity" : "sum",
    "Total" : "sum"
})

grouped

         Quantity  Total
Product
 Apple       10.0   25.0
Apple        10.0   25.0
Banana        5.0    6.0

In [20]:
!pip install pyarrow

Collecting pyarrow
  Downloading pyarrow-19.0.1-cp39-cp39-win_amd64.whl (25.5 MB)
Installing collected packages: pyarrow
Successfully installed pyarrow-19.0.1

In [28]:
df.to_parquet("cleaned_sales.parquet", index = False)